app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Rails Introduction Quizes"], ["description", "testing post"], ["created_at", "2019-04-03 20:58:34.084374"], ["updated_at", "2019-04-03 20:58:34.084374"]]
---
	def create
	  @post = Post.new(post_params(:title, :description,:post_status, :author_id))
	  @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "testing post now"], ["updated_at", "2019-04-03 21:16:38.119975"], ["id", 2]]
---
	def update
	  @post = Post.find(params[:id])
	  @post.update(post_params(:title, :description,:post_status, :author_id))